function walkTime(steps, footprint, speedKmH) {
    let distance = steps * footprint;
    let speed = speedKmH * 1000 / 3600;
    let rest = Math.floor(distance / 500) * 60;
    let time =  (distance / speed) + rest;

    let hours = Math.floor(time / 3600).toFixed(0).padStart(2,'0');
    let minutes = Math.floor(time / 60).toFixed(0).padStart(2,'0');
    let seconds = (time % 60).toFixed(0).padStart(2,'0');

    console.log(`${hours}:${minutes}:${seconds}`);
}

walkTime(2564, 0.70, 5.5);

//  Време за разходка до университета
// Напишете функция, която изчислява колко време отнема на студент да стигне до университета. Функцията приема три числа:
// ⦁ Първото е броят стъпки, които студентът прави от дома си до университета.
// ⦁ Второто число е дължината на стъпката на студента в метри.
// ⦁ Третото число е скоростта на студента в км/ч.
// На всеки 500 метра студентът почива и прави почивка от 1 минута.
// Изчислете колко време студентът ходи от дома до университета и отпечатайте резултата във формат: часове:минути:секунди.
// Входът се предоставя като три числа.
// Изходът трябва да бъде отпечатан на конзолата.